In [1]:
import mysql.connector
#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
  database = "class4pm"
)
db = database.cursor()

In [2]:
sql = "INSERT INTO student(name,roll,physics,chemistry,math,english,nepali,total,per) VALUES('Shyam',34,89,78,87,89,98,468,89)"
db.execute(sql)
database.commit()

In [4]:
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    roll = int(input("Enter roll = "))
    physics = int(input("Enter physics ="))
    chemistry = int(input("Enter chemistry = "))
    math = int(input("Enter math = "))
    english = int(input("Enter english = "))
    nepali = int(input("Enter nepali = "))
    total = physics+chemistry+ math+english +nepali
    per = total/5
    sql = f"INSERT INTO student(name,roll,physics,chemistry,math,english,nepali,total,per) VALUES('{name}',{roll},{physics},{chemistry},{math},{english},{nepali},{total},{per})"
    db.execute(sql)
database.commit()

Enter n = 2
Enter name = Nabin
Enter roll = 3
Enter physics =90
Enter chemistry = 89
Enter math = 98
Enter english = 78
Enter nepali = 98
Enter name = Hari
Enter roll = 7
Enter physics =89
Enter chemistry = 87
Enter math = 78
Enter english = 96
Enter nepali = 90

In [5]:
db.execute("SELECT * FROM student")
           
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 1, 78, 89, 95, 67, 80, 458, 80.0)
(2, 'Shyam', 34, 89, 78, 87, 89, 98, 468, 89.0)
(3, 'Nabin', 3, 90, 89, 98, 78, 98, 453, 90.6)
(4, 'Hari', 7, 89, 87, 78, 96, 90, 440, 88.0)

In [6]:
db.execute("SELECT name,roll,total,per FROM student")
           
result =db.fetchall()
for x in result:
    print(x)

('Ram', 1, 458, 80.0)
('Shyam', 34, 468, 89.0)
('Nabin', 3, 453, 90.6)
('Hari', 7, 440, 88.0)

In [7]:
db.execute("SELECT * FROM student WHERE per >85")
           
result =db.fetchall()
for x in result:
    print(x)

(2, 'Shyam', 34, 89, 78, 87, 89, 98, 468, 89.0)
(3, 'Nabin', 3, 90, 89, 98, 78, 98, 453, 90.6)
(4, 'Hari', 7, 89, 87, 78, 96, 90, 440, 88.0)

In [3]:
sql = "UPDATE student SET name = 'Shyama' WHERE sn = 2"
db.execute(sql)
database.commit()

In [18]:
n = int(input("Enter n = "))
for i in range(n):
    subject = input("Enter subject name (physics,chemistry,math,english,nepali  ")
    name = input("Enter student name = ")
    db.execute(f"SELECT {subject} ,total FROM student WHERE name = '{name}'")
    results =db.fetchall()
    print(results)
    marks =results[0][0]
    total = results[0][1]


    new_marks = int(input("Enter new marks = "))
    resultant_marks = new_marks-marks
    total = total+resultant_marks
    per = total/5

    sql = f"UPDATE student SET physics = {new_marks},total = {total},per = {per} WHERE name = '{name}'"
    db.execute(sql)
database.commit()

Enter subject name (physics,chemistry,math,english,nepali  physics
Enter student name = ram
[(67, 458)]
Enter new marks = 99

In [20]:
name = input("Enter name = ")
sql = f"DELETE FROM student WHERE name = '{name}'"
db.execute(sql)
database.commit()

Enter name = Hari